haneefdm/cortex-debug-samples/psoc6_01_pdl.svd
          <register>
            <name>EVENT_ENABLE</name>
            <description>Event indications enable.</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>ADV_INT_EN</name>
                <description>Advertiser interrupt enable.
1 - enable advertiser procedure to interrupt the firmware.
0 - disable advertiser procedure interrupt to firmware.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCN_INT_EN</name>
                <description>Scanner interrupt enable.
1 - enable scan procedure to interrupt the firmware.
0 - disable scan procedure interrupt to firmware.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_INT_EN</name>
                <description>Initiator interrupt enable.
1 - enable initiator procedure to interrupt the firmware.
0 - disable initiator procedure interrupt to firmware.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_INT_EN</name>
                <description>Connection interrupt enable. 
1 - enable connection procedure to interrupt the firmware.
0 - disable connection procedure interrupt to firmware.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM_INT_EN</name>
                <description>Sleep-mode-exit interrupt enable.  
1 - enable sleep mode exit event to interrupt the firmware.
0 - disable sleep mode exit interrupt to firmware. 
This interrupt is deprecated and should not be used.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_INT_EN</name>
                <description>Deep Sleep-mode-exit interrupt enable.  
1 - enable deep sleep mode exit event to interrupt the firmware.
0 - disable deep sleep mode exit interrupt to firmware.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENC_INT_EN</name>
                <description>Encryption module interrupt enable.  
1 - Enable encryption module interrupt to firmware.
0 - disable encryption module interrupt to firmware. 
This interrupt is deprecated and should not be used</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RSSI_RX_DONE_INT_EN</name>
                <description>RSSI Rx interrupt enable.  
1 - Enable RSSI Rx done interrupt to firmware.
0 - Disable RSSI Rx done interrupt to firmware.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_PARAMS</name>
            <description>Advertising parameters register.</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xE0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>TX_ADDR</name>
                <description>Device own address type. 
1 - Address type is random. 
0 - Address type is public.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_TYPE</name>
                <description>The Advertising type is used to determine the packet type that is used for advertising when advertising is enabled. 
0x0 - Connectable undirected advertising. (adv_ind) 
0x1 - Connectable directed advertising (adv_direct_ind). 
0x2 - Discoverable undirected advertising (adv_discover_ind) 
0x3 - Non connectable undirected advertising (adv_nonconn_ind).</description>
                <bitRange>[2:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_FILT_POLICY</name>
                <description>Advertising filter policy. The set of devices that the advertising procedure uses for device filtering is called the White List. 
0x0 - Allow scan request from any device, allow connect request from any device. 
0x1 - Allow scan request from devices in white list only, allow connect request from any device. 
0x2 - Allow scan request from any device, allow connect request from devices in white list only. 
0x3 - Allow scan request from devices in white list only, allow connect request from devices in white list only.</description>
                <bitRange>[4:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_CHANNEL_MAP</name>
                <description>Advertising channel map indicates the advertising channels used for advertising. By setting the bit, corresponding channel is enabled for use. Atleast one channel bit should be set.  
7 - enable channel 39. 
6 - enable channel 38. 
5 - enable channel 37.</description>
                <bitRange>[7:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_ADDR</name>
                <description>Peer addresses type. This is the Direct_Address_type field programmed, only if ADV_DIRECT_IND type is sent.
1 - Rx addr type is random.
0 - Rx addr type is public</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_SEC_ADDR</name>
                <description>Peer secondary addresses type. This is the Direct_Address_type field programmed, only if ADV_DIRECT_IND type is sent. This address type corresponds to the PEER_SERC_ADDR register. Valid only if PRIV_1_2_ADV is set.
1 - Rx secondary addr type is random.
0 - Rx secondary addr type is public</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_LOW_DUTY_CYCLE</name>
                <description>This bit field is used to specify to the Controller the Low Duty Cycle connectable directed advertising variant being used.
1 - Low Duty Cycle Connectable Directed Advertising.
0 - High Duty Cycle Connectable Directed Advertising.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INITA_RPA_CHECK</name>
                <description>This bit field is used to specify the Advertiser behavior on receiving the same INITA in the connect_req as in the ADV_DIRECT_IND packet it sent. This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set.
0 - Accept the connect_req packet
1 - Reject the connect_req packet</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_ADDR_PRIV</name>
                <description>Device own address type subtype when Address type is random. This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set.
1 - Random Address type is private. 
0 - Random Address type is static.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_RCV_IA_IN_PRIV</name>
                <description>Advertiser behavior when a peer Identity address is received in privacy mode. This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set.
1 - Accept packets with peer identity address not in the Resolving list in privacy mode
0 - Reject packets with peer identity address not in the Resolving list in privacy mode</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_RPT_PEER_NRPA_ADDR_IN_PRIV</name>
                <description>Advertiser behavior when a peer Non Resolvable Private Address is received in privacy mode. This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set. This is applicable when whitelist is disabled.
1 - Only report the packets with peer NRPA address in privacy mode
0 - Respond to packets with peer NRPA address in privacy mode</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCV_TX_ADDR</name>
                <description>Transmit address field of the received packet extracted from the receive packet. This field is used by firmware to report peer_addr_type parameter in the connection complete event.</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_INTERVAL_TIMEOUT</name>
            <description>Advertising interval register.</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x20</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>ADV_INTERVAL</name>
                <description>Range:  0x0020 to 0x4000 (For ADV_IND) 
0x00A0 to 0x4000 (For ADV_SCAN_IND and NONCONN_IND) 
Invalid for ADV_DIRECT_IND 
Time = N * 0.625 msec 
Time Range: 20 ms to 10.24 sec. 
For directed advertising, firmware programs the default value of 1.28 seconds.

In MMMS mode, this register is used as ADV_NI_TIMER when the ADV_NI_VALID is set by firmware</description>
                <bitRange>[14:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_INTR</name>
            <description>Advertising interrupt status and Clear register</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FFF</resetMask>
            <fields>
              <field>
                <name>ADV_STRT_INTR</name>
                <description>If this bit is set it indicates a new advertising event started after interval expiry.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_CLOSE_INTR</name>
                <description>If this bit is set it indicates current advertising event is closed.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_TX_INTR</name>
                <description>If this bit is set it indicates ADV packet is transmitted. 
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_RSP_TX_INTR</name>
                <description>If this bit is set it indicates scan response packet transmitted in response to previous scan request packet received.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_REQ_RX_INTR</name>
                <description>If this bit is set it indicates scan request packet received.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_REQ_RX_INTR</name>
                <description>If this bit is set it indicates connect request packet is received.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLV_CONNECTED</name>
                <description>If this bit is set it indicates that connection is created as slave. 
Write to the register with this bit set to 1, clears the interrupt source.
Note: On a slave connection creation, the link layer cannot enter deepsleep mode in the same slot . It can enter deepsleep mode only in the subsequent slots.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_TIMEOUT</name>
                <description>If this bit is set it indicates that the directed advertising event has timed out after 1.28 seconds. Applicable in adv_direct_ind advertising. 
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_ON</name>
                <description>Advertiser procedure is ON in hardware. Indicates that advertiser procedure is ON in hardware.
1 - ON
0 - OFF</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SLV_CONN_PEER_RPA_UNMCH_INTR</name>
                <description>If this bit is set it indicates that connection is created as slave, but the peer device Resolvable Private Address is not resolved/ ID or NRPA are not matched yet. If the address is not resolved prior to connection establishment, the connection will be terminated.
Write to the register with this bit set to 1, clears the interrupt source. 
This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_REQ_RX_PEER_RPA_UNMCH_INTR</name>
                <description>If this bit is set it indicates scan request packet received, but the peer device Resolvable Private Address is not resolved/ ID or NRPA are not matched yet. 
Write to the register with this bit set to 1, clears the interrupt source. 
This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_ADDR_MATCH_PRIV_MISMATCH_INTR</name>
                <description>If this bit is set it indicates that an Identity address is received from a Scanner and matches an entry in the resolving list, but peer IRK is set and hence a corresponding RPA is expected from the Scanner
Write to the register with this bit set to 1, clears the interrupt source.
This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_ADDR_MATCH_PRIV_MISMATCH_INTR</name>
                <description>If this bit is set it indicates that an Identity address is received from an initiator and matches an entry in the resolving list, but peer IRK is set and hence a corresponding RPA is expected from the initiator
Write to the register with this bit set to 1, clears the interrupt source.
This bit is valid only if PRIV_1_2 and PRIV_1_2_ADV are set.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_NEXT_INSTANT</name>
            <description>Advertising next instant.</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ADV_NEXT_INSTANT</name>
                <description>Shows the next start of advertising event with reference to the internal reference clock.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAN_INTERVAL</name>
            <description>Scan Interval Register</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x10</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SCAN_INTERVAL</name>
                <description>Scan interval register. Interval between two consecutive scanning events. Firmware sets the scanning interval value to this register before issuing start scan command.
Range: 0x0004 to 0x4000 
Default: 0x0010 (10 ms) 
Time = N * 0.625 msec  
Time Range: 2.5 msec to 10.24 sec.

In MMMS mode, this register is used as SCAN_NI_TIMER when the SCAN_NI_VALID is set by firmware</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAN_WINDOW</name>
            <description>Scan window Register</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x10</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SCAN_WINDOW</name>
                <description>Duration of scan in a scanning event, which should be less than or equal to scan interval value. Firmware sets the scan window value to this register before issuing start scan command.
Range: 0x0004 to 0x4000 
Default: 0x0010 (10 ms) 
Time = N * 0.625 msec  
Time Range: 2.5 msec to 10.24 sec.
(To prevent ADV RX - SCAN REQ TX - SCAN RSP RX spilling over across the scan window, when not in continuous scan, the scan window must be 2 slots less that the scan interval.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
