haneefdm/cortex-debug-samples/psoc6_01_pdl.svd
          <register>
            <name>CONN_INTR_MASK</name>
            <description>Connection Interrupt mask</description>
            <addressOffset>0x1F0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x2000</resetValue>
            <resetMask>0xE3FF</resetMask>
            <fields>
              <field>
                <name>CONN_CL_INT_EN</name>
                <description>If this bit is set connection closed interrupt is enabled.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_ESTB_INT_EN</name>
                <description>If this bit is set connection establishment interrupt is enabled.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MAP_UPDT_INT_EN</name>
                <description>If this bit is set, channel map update interrupt is enabled.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>START_CE_INT_EN</name>
                <description>If this bit is set connection event start interrupt is enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLOSE_CE_INT_EN</name>
                <description>If this bit is set connection event closed interrupt is enabled.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CE_TX_ACK_INT_EN</name>
                <description>If this bit is set transmission acknowledgement interrupt is enabled: 
This interrupt is generated to indicate to the firmware that a non-empty packet transmitted is successfully acknowledged by the remote device.
For negative acknowledgements from remote device, this interrupt indication is not generated.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CE_RX_INT_EN</name>
                <description>If this bit is set interrupt is enabled for reception of packet in a connection event.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_UPDATE_INTR_EN</name>
                <description>If this bit is set connection update interrupt is enabled.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_GOOD_PDU_INT_EN</name>
                <description>If this bit is set packet receive good pdu interrupt is enabled. Effective only when bit 6 is set.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_BAD_PDU_INT_EN</name>
                <description>If this bit is set packet receive bad pdu interrupt is enabled. Effective only when bit 6 is set.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CE_CLOSE_NULL_RX_INT_EN</name>
                <description>If this but us set, the RX interrupt is triggerred for an end of connection event with a null packet</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PING_TIMER_EXPIRD_INTR</name>
                <description>If this bit is set ping timer expired interrupt is enabled.</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PING_NEARLY_EXPIRD_INTR</name>
                <description>If this bit is set ping timer nearly expired interrupt is enabled</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SLAVE_TIMING_CONTROL</name>
            <description>slave timing control</description>
            <addressOffset>0x1F4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xBE96</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SLAVE_TIME_SET_VAL</name>
                <description>Programmable adjust value to the clock counter when slave is connected</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLAVE_TIME_ADJ_VAL</name>
                <description>Timing adjust value. The internal micro second counter is adjusted to this value whenever slave receives a good access address match at connection anchor point. This will ensure the slave gets synchronized to master timing.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RECEIVE_TRIG_CTRL</name>
            <description>Receive trigger control</description>
            <addressOffset>0x1F8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF3F</resetMask>
            <fields>
              <field>
                <name>ACC_TRIGGER_THRESHOLD</name>
                <description>Access address match threshold value. Number of bits of ac-cess address that should match with the expected access ad-dress to trigger an access code match. 

Max value : 32  (for 32-bit access address)
Lower values may be programmed for bad radios or channels but care must be taken to ensure there are no 'false' matches due to reduced number of bits required to match.</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_TRIGGER_TIMEOUT</name>
                <description>If access address match does not occur then within this time from the start of receive operation, the receive operation times out and stops.  An internal counter value of 1usec resolution is continuously compared with the value programmed.
Max value :0xFF</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_1</name>
            <description>LL debug register 1</description>
            <addressOffset>0x200</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>CONN_RX_WR_PTR</name>
                <description>Connection receive FIFO write pointer</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_2</name>
            <description>LL debug register 2</description>
            <addressOffset>0x204</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>CONN_RX_RD_PTR</name>
                <description>Connection receive FIFO read pointer</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_3</name>
            <description>LL debug register 3</description>
            <addressOffset>0x208</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>CONN_RX_WR_PTR_STORE</name>
                <description>Connection receive FIFO stored write pointer for pointer restore</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_4</name>
            <description>LL debug register 4</description>
            <addressOffset>0x20C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FF</resetMask>
            <fields>
              <field>
                <name>CONNECTION_FSM_STATE</name>
                <description>Connection FSM state</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SLAVE_LATENCY_FSM_STATE</name>
                <description>Slave Latency FSM state</description>
                <bitRange>[5:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADVERTISER_FSM_STATE</name>
                <description>Advertiser FSM state</description>
                <bitRange>[10:6]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_5</name>
            <description>LL debug register 5</description>
            <addressOffset>0x210</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>INIT_FSM_STATE</name>
                <description>Initiator FSM state</description>
                <bitRange>[4:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SCAN_FSM_STATE</name>
                <description>Scanner FSM state</description>
                <bitRange>[9:5]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_6</name>
            <description>LL debug register 6</description>
            <addressOffset>0x214</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FFF</resetMask>
            <fields>
              <field>
                <name>ADV_TX_WR_PTR</name>
                <description>Advertiser Transmit FIFO write pointer</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SCAN_RSP_TX_WR_PTR</name>
                <description>Scan Response Transmit FIFO write pointer</description>
                <bitRange>[7:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADV_TX_RD_PTR</name>
                <description>Advertiser/ Scan Response FIFO read pointer</description>
                <bitRange>[13:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_7</name>
            <description>LL debug register 7</description>
            <addressOffset>0x218</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FFF</resetMask>
            <fields>
              <field>
                <name>ADV_RX_WR_PTR</name>
                <description>Advertiser Receive FIFO write pointer</description>
                <bitRange>[6:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADV_RX_RD_PTR</name>
                <description>Advertiser Receive FIFO read pointer</description>
                <bitRange>[13:7]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_8</name>
            <description>LL debug register 8</description>
            <addressOffset>0x21C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FFF</resetMask>
            <fields>
              <field>
                <name>ADV_RX_WR_PTR_STORE</name>
                <description>Advertiser Receive FIFO stored write pointer for pointer restore</description>
                <bitRange>[6:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WLF_PTR</name>
                <description>Whitelist FIFO pointer</description>
                <bitRange>[13:7]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_9</name>
            <description>LL debug register 9</description>
            <addressOffset>0x220</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x10</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>WINDOW_WIDEN</name>
                <description>Window Widening value in us. The reset value of this register is 0x0000. After reset de-assertion, at the first clock cycle, the value 0x0010 is assigned to the register.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DBG_10</name>
            <description>LL debug register 10</description>
            <addressOffset>0x224</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>RF_CHANNEL_NUM</name>
                <description>Active channel number</description>
                <bitRange>[5:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PEER_ADDR_INIT_L</name>
            <description>Lower 16 bit address of the peer device for INIT.</description>
            <addressOffset>0x230</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PEER_ADDR_L</name>
                <description>Lower 16 bit of 48-bit address of the peer device. This is used only in MMMS mode

The peer address registers are used for multiple purposes. The register is written by firmware to provide the peer address to be used for a hardware procedure. When firmware reads the register, it reads back peer address values updated by hardware. 

While device is configured as an initiator without white list filtering, the peer address specified in the peer_address field of the create connection command is programmed into this register, which is used by hard-ware procedures.

While device is configured as an initiator and white list is enabled, firmware can read this register to get the address of the peer device from which connectable ADV packet was received and to which the connection is created.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PEER_ADDR_INIT_M</name>
            <description>Middle 16 bit address of the peer device for INIT.</description>
            <addressOffset>0x234</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PEER_ADDR_M</name>
                <description>Middle 16 bit of 48-bit address of the peer device. This is used only in MMMS mode

The peer address registers are used for multiple purposes. The register is written by firmware to provide the peer address to be used for a hardware procedure. When firmware reads the register, it reads back peer address values updated by hardware. 

While device is configured as an initiator without white list filtering, the peer address specified in the peer_address field of the create connection command is programmed into this register, which is used by hard-ware procedures.

While device is configured as an initiator and white list is enabled, firmware can read this register to get the address of the peer device from which connectable ADV packet was received and to which the connection is created.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PEER_ADDR_INIT_H</name>
            <description>Higher 16 bit address of the peer device for INIT.</description>
            <addressOffset>0x238</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PEER_ADDR_H</name>
                <description>Higher 16 bit of 48-bit address of the peer device. This is used only in MMMS mode

The peer address registers are used for multiple purposes. The register is written by firmware to provide the peer address to be used for a hardware procedure. When firmware reads the register, it reads back peer address values updated by hardware. 

While device is configured as an initiator without white list filtering, the peer address specified in the peer_address field of the create connection command is programmed into this register, which is used by hard-ware procedures.

While device is configured as an initiator and white list is enabled, firmware can read this register to get the address of the peer device from which connectable ADV packet was received and to which the connection is created.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PEER_SEC_ADDR_ADV_L</name>
            <description>Lower 16 bits of the secondary address of the peer device for ADV_DIR.</description>
            <addressOffset>0x23C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PEER_SEC_ADDR_L</name>
                <description>Lower 16 bit of 48-bit secondary address of the peer device for ADV_DIR.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PEER_SEC_ADDR_ADV_M</name>
            <description>Middle 16 bits of the secondary address of the peer device for ADV_DIR.</description>
            <addressOffset>0x240</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PEER_SEC_ADDR_M</name>
                <description>Middle 16 bit of 48-bit secondary address of the peer device for ADV_DIR.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PEER_SEC_ADDR_ADV_H</name>
            <description>Higher 16 bits of the secondary address of the peer device for ADV_DIR.</description>
            <addressOffset>0x244</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PEER_SEC_ADDR_H</name>
                <description>Higher 16 bit of 48-bit secondary address of the peer device for ADV_DIR.

