haneefdm/cortex-debug-samples/psoc6_01_pdl.svd
          <register>
            <name>LL_CONTROL</name>
            <description>LL Backward compatibility</description>
            <addressOffset>0xF00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x2</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PRIV_1_2</name>
                <description>Enables Privacy 1.2 Feature.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DLE</name>
                <description>Enables Data Length extension feature in DTM, connection and encryption modules.
This bit should always be set to 1'b1. 1'b0 is not supported.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WL_READ_AS_MEM</name>
                <description>The Whilelist read logic is controlled using this bit.
0 - The reads to the whitelist address range is treated as FIFO reads and the pointers are reset by issueing the RESET_READ_PTR command.
1 - The reads to the whitelist address range is treated an memory reads. Any whilelist entry can be read.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADVCH_FIFO_PRIV_1_2_FLUSH_CTRL</name>
                <description>Controls the ADVCH FIFO flushing when PRIV_1_2 is enabled. 
0 - Flushes all ADV &amp; INIT packets, as in non privacy 1.2 mode, except those with unresolved peer or self RPA.
1 - Does not flush any CRC good packets</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HW_RSLV_LIST_FULL</name>
                <description>This bit indicates that the resolving list in the hardware is full and the list is extended in the FW. This will affect the behavior of address resolution.
0 - The resolving list in the hardware is not fully filled. When Whitelist is disabled and a peer identity address not in the resolving list is received, the packet is responded to by the hardware.
1 - The resolving list in the hardware is fully filled. All address comparisons must be extended to the Firmware list as well, Any match in the Firmware list should be followed by copying the matching entry into the hardware resolving list.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RPT_INIT_ADDR_MATCH_PRIV_MISMATCH_ADV</name>
                <description>This bit controls the ADV engine behavior when an initiator address match occurs but a privacy mismatch occurs
0 - The packet is aborted
1 - The packet is received and reported to the Link Layer firmware</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RPT_SCAN_ADDR_MATCH_PRIV_MISMATCH_ADV</name>
                <description>This bit controls the ADV engine behavior when a scanner address match occurs but a privacy mismatch occurs
0 - The packet is aborted
1 - The packet is received and reported to the Link Layer firmware</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_SCN</name>
                <description>This bit controls the SCAN engine behavior when an peer address match occurs but a privacy mismatch occurs
0 - The packet is aborted
1 - The packet is received and reported to the Link Layer firmware</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_INI</name>
                <description>This bit controls the INIT engine behavior when an peer address match occurs but a privacy mismatch occurs
0 - The packet is aborted
1 - The packet is received and reported to the Link Layer firmware</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_INI</name>
                <description>This bit controls the INIT engine behavior when a self address match occurs but a privacy mismatch occurs
0 - The packet is aborted
1 - The packet is received and reported to the Link Layer firmware</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIV_1_2_ADV</name>
                <description>Enables Privacy 1.2 for ADV engine</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIV_1_2_SCAN</name>
                <description>Enables Privacy 1.2 for SCAN engine</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIV_1_2_INIT</name>
                <description>Enables Privacy 1.2 for INIT engine</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_CONN_RX_EN_MOD</name>
                <description>This bit controls the Connection RX enable modification mode when SLV_CONN_PEER_RPA_NOT_RSLVD is set.
1'b0 - The Connection RX enable is unmodified
1'b1 - The Connection RX enable is during the Peer INIT RPA unresolved state is modified, until it is resolved.</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLV_CONN_PEER_RPA_NOT_RSLVD</name>
                <description>This bit is asserted when SLV_CONN_PEER_RPA_UNMCH_INTR is set. The device does not enter into Connection established state until this bit is cleared after the RPA is resoved by the firmware. If the firmware is not able to resolve the RPA within the supervision timeout, the device aborts the connection establishement and this bit is cleared by the hardware.
This bit is valid only if PRIV_1_2 is set.</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADVCH_FIFO_FLUSH</name>
                <description>When set, flushes the ADVCH FIFO. The bit is auto cleared. 
Note that this should be used only when the FIFO is not read by the firmware. If firmware has started reading the FIFO, then the FIFO must be emptied exclusively by firmware reads</description>
                <bitRange>[15:15]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DEV_PA_ADDR_L</name>
            <description>Device Resolvable/Non-Resolvable Private address lower register</description>
            <addressOffset>0xF04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3412</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DEV_PA_ADDR_L</name>
                <description>Lower 16 bit of 48-bit Random Private address of the device.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DEV_PA_ADDR_M</name>
            <description>Device Resolvable/Non-Resolvable Private address middle register</description>
            <addressOffset>0xF08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x56</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DEV_PA_ADDR_M</name>
                <description>Middle 16 bit of 48-bit Random Private address of the device.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DEV_PA_ADDR_H</name>
            <description>Device Resolvable/Non-Resolvable Private address higher register</description>
            <addressOffset>0xF0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DEV_PA_ADDR_H</name>
                <description>Higher 16 bit of 48-bit Random Private address of the device.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>16</dim>
            <dimIncrement>4</dimIncrement>
            <name>RSLV_LIST_ENABLE[%s]</name>
            <description>Resolving list entry control bit</description>
            <addressOffset>0xF10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FF</resetMask>
            <fields>
              <field>
                <name>VALID_ENTRY</name>
                <description>Indicates if the index is valid</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PEER_ADDR_IRK_SET</name>
                <description>Indicates if the listed peer device has shared its IRK.
0 - Identity address in a received packet is accepted. If a valid peer device RPA is available in the list, then the RPA in a received packet is accepted.
1 - Only the peer device RPA, if available in the list, in a received packet is accepted. An Identity address in the received packet is reported as a privacy mismatch.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SELF_ADDR_IRK_SET_RX</name>
                <description>Indicates if the local IRK has been shared with the listed peer device
0 - Self Identity address in a received packet is accepted. If a valid self RPA is available in the list, then the RPA in a received packet is accepted.
1 - Only the self device RPA, if available in the list, in a received packet is accepted. A Self Identity address in the received packet is reported as a privacy mismatch.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WHITELISTED_PEER</name>
                <description>Indicates if the listed peer device is in the whitelist</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PEER_ADDR_TYPE</name>
                <description>Indicates the address type of the listed peer device</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PEER_ADDR_RPA_VAL</name>
                <description>Indicates that the peer device RPA in the list is valid</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SELF_ADDR_RXD_RPA_VAL</name>
                <description>Indicates that the received self RPA in the list is valid</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SELF_ADDR_TX_RPA_VAL</name>
                <description>Indicates that the self RPA in the list to be transmitted is valid</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SELF_ADDR_INIT_RPA_SEL</name>
                <description>When Initiator whitelist is disabled, this bit indicates the specific device to from which ADV packets will be accepted.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SELF_ADDR_TYPE_TX</name>
                <description>Indicates the TX addr type to be used for SCANA and INITA 
0 - Self Identity address is used in SCANA/INITA in SCAN_REQ/CONN_REQ packets
1 - Self RPA address provided in RSLV_LIST_TX_INIT_RPA field in the resolving list with the associated valid bit in SELF_ADDR_TX_RPA_VAL above is used in SCANA/INITA in SCAN_REQ/CONN_REQ packets</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENTRY_CONNECTED</name>
                <description>Indicates if the entry is already in connection with our device</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WL_CONNECTION_STATUS</name>
            <description>whitelist valid entry bit</description>
            <addressOffset>0xFA0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>WL_ENTRY_CONNECTED</name>
                <description>Stores the connection status of each of the sixteen device address stored in the whitelist.
1 - White list entry is already in a connection
0 - White list entry is not in a connection</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_RXMEM_BASE_ADDR_DLE</name>
            <description>DLE Connection RX memory base address</description>
            <addressOffset>0x1800</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_RX_MEM_BASE_ADDR_DLE</name>
                <description>Data from Rx memory are read as 32-bit wide data. This memory is valid only if DLE is set.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_TXMEM_BASE_ADDR_DLE</name>
            <description>DLE Connection TX memory base address</description>
            <addressOffset>0x2800</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_TX_MEM_BASE_ADDR_DLE</name>
                <description>Data to Tx memory are written as 32-bit wide data. This memory is valid only if DLE is set.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_1_PARAM_MEM_BASE_ADDR</name>
            <description>Connection Parameter memory base address for connection 1</description>
            <addressOffset>0x12800</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_1_PARAM</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_2_PARAM_MEM_BASE_ADDR</name>
            <description>Connection Parameter memory base address for connection 2</description>
            <addressOffset>0x12880</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_2_PARAM</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_3_PARAM_MEM_BASE_ADDR</name>
            <description>Connection Parameter memory base address for connection 3</description>
            <addressOffset>0x12900</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_3_PARAM</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_4_PARAM_MEM_BASE_ADDR</name>
            <description>Connection Parameter memory base address for connection 4</description>
            <addressOffset>0x12980</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_4_PARAM</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NI_TIMER</name>
            <description>Next Instant Timer</description>
            <addressOffset>0x14000</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>NI_TIMER</name>
                <description>BT Slot at which the next connection has to be serviced, granularity is 625us. The NI timer has to be programmed 1.25ms before the connection event</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>US_OFFSET</name>
            <description>Micro-second Offset</description>
            <addressOffset>0x14004</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>US_OFFSET_SLOT_BOUNDARY</name>
                <description>Micro Second Offset from the Slot Bounday at which the connection programmed in NEXT_CONN has to be serviced. This register along with NI_TIMER has to be programmed 1.25ms before the connection event. The granularity is 1us</description>
                <bitRange>[9:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NEXT_CONN</name>
            <description>Next Connection</description>
            <addressOffset>0x14008</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>NEXT_CONN_INDEX</name>
                <description>Connection Index to be serviced. Allowed values are 0,1,2,3.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NEXT_CONN_TYPE</name>
                <description>Connection type
1 - Master Connection
0 - Slave Connection</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NI_VALID</name>
                <description>Flag indication if programmed NI_TIMER is valid. FW sets this bit to indicate that the NI_TIMER is programmed. HW clears this bit on servicing the connection of if NI_TIMER is pointing to past value</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NI_ABORT</name>
            <description>Abort next scheduled connection</description>
            <addressOffset>0x1400C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>NI_ABORT</name>
                <description>Setting this bit clears the schedule NI</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ABORT_ACK</name>
                <description>This bit will set if the scheduled NI is aborted</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
