haneefdm/cortex-debug-samples/psoc6_01_pdl.svd
          <register>
            <name>INTR_STAT</name>
            <description>Link Layer interrupt status register</description>
            <addressOffset>0x68</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>DSM_ENTERED_INTR</name>
                <description>On a firmware request to LL to enter into state machine, working on LF clock, LL transitions into Deep Sleep Mode and asserts this interrupt. The interrupt can be cleared by writing one into this location.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_EXITED_INTR</name>
                <description>On a firmware request to LL to exit from Deep Sleep Mode, working on LF clock, LL transitions from Deep Sleep Mode and asserts this interrupt when the Deep Sleep clock gater is turned ON. The interrupt can be cleared by writing one into this location.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCBLL_DONE_INTR</name>
                <description>RCB transaction Complete</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BLERD_ACTIVE_INTR</name>
                <description>CYBLERD55 is in active mode. RF is active</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCB_INTR</name>
                <description>RCB controller Interrupt - Refer to RCB_INTR_STAT register</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>LL_INTR</name>
                <description>LL controller interrupt - Refer to EVENT_INTR register</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>GPIO_INTR</name>
                <description>GPIO interrupt</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EFUSE_INTR</name>
                <description>This bit when set by efuse controller logic when the efuse read/write is completed</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XTAL_ON_INTR</name>
                <description>enabled crystal stable signal rising edge interrupt. The interrupt can be cleared by writing one into this location.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENC_INTR</name>
                <description>Encryption Interrupt Triggered</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HVLDO_LV_DETECT_POS</name>
                <description>This interrupt is set on HVLDO LV Detector Rise edge. There is a 1cycle AHB clock glitch filter on the HVLDO LV Detector output</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVLDO_LV_DETECT_NEG</name>
                <description>This interrupt is set on HVLDO LV Detector Fall edge. There is a 1cycle AHB clock glitch filter on the HVLDO LV Detector output</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>Link Layer interrupt mask register</description>
            <addressOffset>0x6C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FFF</resetMask>
            <fields>
              <field>
                <name>DSM_EXIT</name>
                <description>When the Link Layer is in Deep Sleep Mode, firmware can set this bit to wake the Link Layer.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_ENTERED_INTR_MASK</name>
                <description>Masks the DSM Entered Interrupt, when disabled.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_EXITED_INTR_MASK</name>
                <description>Masks the DSM Exited Interrupt, when disabled.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XTAL_ON_INTR_MASK</name>
                <description>Masks the Crystal Stable Interrupt, when disabled.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCBLL_INTR_MASK</name>
                <description>Mask for RCBLL interrupt</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BLERD_ACTIVE_INTR_MASK</name>
                <description>Mask for CYBLERD55 Active Interrupt</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCB_INTR_MASK</name>
                <description>Mask for RCB interrupt</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LL_INTR_MASK</name>
                <description>Mask for LL interrupt</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GPIO_INTR_MASK</name>
                <description>Mask for GPIO interrupt</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EFUSE_INTR_MASK</name>
                <description>This bit enables the efuse interrupt to firmware</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENC_INTR_MASK</name>
                <description>Mask for Encryption interrupt</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVLDO_LV_DETECT_POS_MASK</name>
                <description>Mask for HVLDO LV Detector Rise edge interrupt</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVLDO_LV_DETECT_NEG_MASK</name>
                <description>Mask for HVLDO LV Detector Fall edge interrupt</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_CLK_EN</name>
            <description>Link Layer primary clock enable</description>
            <addressOffset>0x70</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x26</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>CLK_EN</name>
                <description>Set this bit 1 to enable the clock to Link Layer.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CY_CORREL_EN</name>
                <description>If MXD_IF option is 1, this bit needs to be set to enable configuring the correlator through BLELL.DPLL_CONFIG register</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MXD_IF_OPTION</name>
                <description>1: MXD IF option 0: CYBLERD55 correlates Access Code
0: MXD IF option 1: LL correlates Access Code</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_RCB_CLK</name>
                <description>0: AHB clock (clk_sys) is used as the clock for RCB access
1: LL clock (clk_eco) is used as the clock for RCB access</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BLESS_RESET</name>
                <description>0: No Soft Reset
1: Initiate Soft Reset
Setting this bit will reset entire BLESS_VER3</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DPSLP_HWRCB_EN</name>
                <description>Controls the DPSLP entry and exit writes to RD and controls the active domain reset and clock.
1 - LL HW controls the RD active domain reset and clock.
0 - The RD active domain reset and clock. Must be controlled by the FW</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LF_CLK_CTRL</name>
            <description>BLESS LF clock control and BLESS revision ID indicator</description>
            <addressOffset>0x74</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x40000000</resetValue>
            <resetMask>0xE0000003</resetMask>
            <fields>
              <field>
                <name>DISABLE_LF_CLK</name>
                <description>When set to 1, gates the LF clock input to the Link Layer. Ths is done for extended DSM mode where the DSM state machine needs to be forzen to prevent a default auto exit.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_ENC_CLK</name>
                <description>This bit is used to enable the clock to the encryption engine
0 - Disable the clock to ENC engine
1 - Enable the clock to ENC engine</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>M0S8BLESS_REV_ID</name>
                <description>Indicates the m0s8bless IP revision.</description>
                <bitRange>[31:29]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXT_PA_LNA_CTRL</name>
            <description>External TX PA and RX LNA control</description>
            <addressOffset>0x78</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3E</resetMask>
            <fields>
              <field>
                <name>ENABLE_EXT_PA_LNA</name>
                <description>When set to 1, enables the external PA &amp; LNA</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHIP_EN_POL</name>
                <description>Controls the polarity of the chip enable control signal
0 - High enable, low disable
1 - Low enable, High disable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PA_CTRL_POL</name>
                <description>Controls the polarity of the PA control signal
0 - High enable, low disable
1 - Low enable, High disable</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LNA_CTRL_POL</name>
                <description>Controls the polarity of the LNA control signal
0 - High enable, low disable
1 - Low enable, High disable</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EN_DRIVE_VAL</name>
                <description>Configures the drive value on the output enables of PA, LNA and CHI_EN signals
0 - drive 0 on the output enable signals
1 - drive 1 on the output enable signals</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_PKT_RSSI_CH_ENERGY</name>
            <description>Link Layer Last Received packet RSSI/Channel energy and channel number</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFFFF</resetMask>
            <fields>
              <field>
                <name>RSSI</name>
                <description>This field captures the RSSI of the packet when a packet reception is complete or gives the Channel energy when a Receive cycle is over without packet reception.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_CHANNEL</name>
                <description>This field indicates the last channel for which the RSSI is captured</description>
                <bitRange>[21:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PKT_RSSI_OR_CH_ENERGY</name>
                <description>This field indicates if the captured RSSI is for a received packet or is the channel energy</description>
                <bitRange>[22:22]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BT_CLOCK_CAPT</name>
            <description>BT clock captured on an LL DSM exit</description>
            <addressOffset>0x84</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>BT_CLOCK</name>
                <description>This field captures the LF BT clock captured on an LL DSM exit. This register is valid only when MT_STATUS.LL_CLK_STATE is set. This value may be used to manage the low power entry.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
