haneefdm/cortex-debug-samples/psoc6_01_pdl.svd
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <name>B1_DATA_REG[%s]</name>
            <description>Programmable B1 Data register (0-3)</description>
            <addressOffset>0x140</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>B1_DATA</name>
                <description>Programmable B1 Data register</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_MEM_BASE_ADDR</name>
            <description>Encryption memory base address</description>
            <addressOffset>0x150</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENC_MEM</name>
                <description>Data values written to Enc memory are written as 16-bit wide data. This memory is valid only if DLE is set.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_LDO_0</name>
            <description>LDO Trim register 0</description>
            <addressOffset>0xF00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x58</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>ACT_LDO_VREG</name>
                <description>To trim the regulated voltage in steps of 25mV typically</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACT_LDO_ITAIL</name>
                <description>To trim the bias currents for all the active mode blocks</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_LDO_1</name>
            <description>LDO Trim register 1</description>
            <addressOffset>0xF04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x8</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>ACT_REF_BGR</name>
                <description>To trim active regulator reference voltage</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SB_BGRES</name>
                <description>To trim standby regulator reference voltage</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_LDO_2</name>
            <description>LDO Trim register 2</description>
            <addressOffset>0xF08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x60</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>SB_BMULT_RES</name>
                <description>To trim standby regulator beta-multiplier current</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SB_BMULT_NBIAS</name>
                <description>To trim standby regulator beta-multiplier current</description>
                <bitRange>[6:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_LDO_3</name>
            <description>LDO Trim register 3</description>
            <addressOffset>0xF0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x10</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>LVDET</name>
                <description>To trim the trip points of the LV-Detect block</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLOPE_SB_BMULT</name>
                <description>To trim standby regulator beta-multiplier temp-co slope</description>
                <bitRange>[6:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <name>TRIM_MXD[%s]</name>
            <description>MXD die Trim registers</description>
            <addressOffset>0xF10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>MXD_TRIM_BITS</name>
                <description>MXD trim bits</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_LDO_4</name>
            <description>LDO Trim register 4</description>
            <addressOffset>0xF30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>T_LDO</name>
                <description>To debug post layout or post silicon</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_LDO_5</name>
            <description>LDO Trim register 5</description>
            <addressOffset>0xF34</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>RSVD</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
